## Terraform Plan
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 8 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                        NAME                                         |
|--------|-------------------------------------------------------------------------------------|
| add    | `azuread_named_location.canada`                                                     |
|        | `azuread_named_location.esdc_ips`                                                   |
|        | `azuread_named_location.united_states`                                              |
|        | `module.ai_answers_api_key.azurerm_cognitive_deployment.deployment[&quot;openai-gpt41&quot;]` |
|        | `module.block_non_browser.azuread_conditional_access_policy.this`                   |
|        | `module.block_non_macos.azuread_conditional_access_policy.this`                     |
|        | `module.block_out_of_canada.azuread_conditional_access_policy.this`                 |
|        | `module.block_tc_user_portal_access.azuread_conditional_access_policy.this`         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuread_named_location.canada will be created
  + resource "azuread_named_location" "canada" {
      + display_name = "Canada"
      + id           = (known after apply)

      + country {
          + countries_and_regions                 = [
              + "CA",
            ]
          + country_lookup_method                 = "clientIpAddress"
          + include_unknown_countries_and_regions = false
        }
    }

  # azuread_named_location.esdc_ips will be created
  + resource "azuread_named_location" "esdc_ips" {
      + display_name = "ESDC IPs"
      + id           = (known after apply)

      + ip {
          + ip_ranges = [
              + "198.103.0.0/16",
            ]
          + trusted   = true
        }
    }

  # azuread_named_location.united_states will be created
  + resource "azuread_named_location" "united_states" {
      + display_name = "United States"
      + id           = (known after apply)

      + country {
          + countries_and_regions                 = [
              + "US",
            ]
          + country_lookup_method                 = "clientIpAddress"
          + include_unknown_countries_and_regions = false
        }
    }

  # module.ai_answers_api_key.azurerm_cognitive_deployment.deployment["openai-gpt41"] will be created
  + resource "azurerm_cognitive_deployment" "deployment" {
      + cognitive_account_id   = "/subscriptions/5617b0eb-50cc-4fe6-b57e-021e6ec245f0/resourceGroups/nimwzfg-ai-answers/providers/Microsoft.CognitiveServices/accounts/ai-answers-nimwzfg"
      + id                     = (known after apply)
      + name                   = "openai-gpt41"
      + version_upgrade_option = "OnceNewDefaultVersionAvailable"

      + model {
          + format  = "OpenAI"
          + name    = "gpt-4.1"
          + version = "2025-04-14"
        }

      + sku {
          + capacity = 400
          + name     = "GlobalStandard"
        }
    }

  # module.block_non_browser.azuread_conditional_access_policy.this will be created
  + resource "azuread_conditional_access_policy" "this" {
      + display_name = "Conditional Access - Block Non-Browser Access"
      + id           = (known after apply)
      + object_id    = (known after apply)
      + state        = "enabled"

      + conditions {
          + client_app_types    = [
              + "exchangeActiveSync",
              + "mobileAppsAndDesktopClients",
              + "other",
            ]
          + insider_risk_levels = (known after apply)

          + applications {
              + excluded_applications = [
                  + "797f4846-ba00-4fd7-ba43-dac1f8f63013",
                ]
              + included_applications = [
                  + "All",
                ]
            }

          + locations {
              + excluded_locations = []
              + included_locations = [
                  + "All",
                ]
            }

          + platforms {
              + excluded_platforms = []
              + included_platforms = [
                  + "all",
                ]
            }

          + users {
              + excluded_groups = [
                  + "86a827be-9f2d-46fe-992e-9445ec10e840",
                  + "9c8babe3-fe86-42b1-ace6-16734f559c60",
                  + "dda4f58f-e024-40da-9403-761270c5cc47",
                ]
              + included_users  = [
                  + "All",
                ]
            }
        }

      + grant_controls {
          + built_in_controls = [
              + "block",
            ]
          + operator          = "OR"
        }
    }

  # module.block_non_macos.azuread_conditional_access_policy.this will be created
  + resource "azuread_conditional_access_policy" "this" {
      + display_name = "Conditional Access - Block Non-MacOS Systems"
      + id           = (known after apply)
      + object_id    = (known after apply)
      + state        = "enabled"

      + conditions {
          + client_app_types    = [
              + "all",
            ]
          + insider_risk_levels = (known after apply)

          + applications {
              + excluded_applications = []
              + included_applications = [
                  + "All",
                ]
            }

          + locations {
              + excluded_locations = (known after apply)
              + included_locations = [
                  + "All",
                ]
            }

          + platforms {
              + excluded_platforms = [
                  + "macOS",
                  + "linux",
                ]
              + included_platforms = [
                  + "all",
                ]
            }

          + users {
              + excluded_groups = [
                  + "86a827be-9f2d-46fe-992e-9445ec10e840",
                ]
              + included_users  = [
                  + "All",
                ]
            }
        }

      + grant_controls {
          + built_in_controls = [
              + "block",
            ]
          + operator          = "OR"
        }
    }

  # module.block_out_of_canada.azuread_conditional_access_policy.this will be created
  + resource "azuread_conditional_access_policy" "this" {
      + display_name = "Conditional Access - Block Out of Canada"
      + id           = (known after apply)
      + object_id    = (known after apply)
      + state        = "enabled"

      + conditions {
          + client_app_types    = [
              + "all",
            ]
          + insider_risk_levels = (known after apply)

          + applications {
              + excluded_applications = []
              + included_applications = [
                  + "All",
                ]
            }

          + locations {
              + excluded_locations = (known after apply)
              + included_locations = [
                  + "All",
                ]
            }

          + platforms {
              + excluded_platforms = []
              + included_platforms = [
                  + "all",
                ]
            }

          + users {
              + excluded_groups = [
                  + "86a827be-9f2d-46fe-992e-9445ec10e840",
                ]
              + included_users  = [
                  + "All",
                ]
            }
        }

      + grant_controls {
          + built_in_controls = [
              + "block",
            ]
          + operator          = "OR"
        }
    }

  # module.block_tc_user_portal_access.azuread_conditional_access_policy.this will be created
  + resource "azuread_conditional_access_policy" "this" {
      + display_name = "Conditional Access - Block TC Users Portal Access"
      + id           = (known after apply)
      + object_id    = (known after apply)
      + state        = "enabled"

      + conditions {
          + client_app_types    = [
              + "all",
            ]
          + insider_risk_levels = (known after apply)

          + applications {
              + excluded_applications = []
              + included_applications = [
                  + "797f4846-ba00-4fd7-ba43-dac1f8f63013",
                ]
            }

          + locations {
              + excluded_locations = []
              + included_locations = [
                  + "All",
                ]
            }

          + platforms {
              + excluded_platforms = []
              + included_platforms = [
                  + "all",
                ]
            }

          + users {
              + excluded_groups = []
              + included_users  = []
            }
        }

      + grant_controls {
          + built_in_controls = [
              + "block",
            ]
          + operator          = "OR"
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers_api_key.azurerm_cognitive_account.openai"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers_api_key.azurerm_resource_group.rg"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_core_hackathon_api_key.azurerm_cognitive_account.openai"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_core_hackathon_api_key.azurerm_resource_group.rg"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_app_service_principal.azuread_application.sp_app[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_app_service_principal.azuread_service_principal.sp[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.valentine_api_key.azurerm_cognitive_account.openai"]
WARN - plan.json - main - Missing Common Tags: ["module.valentine_api_key.azurerm_resource_group.rg"]

27 tests, 19 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
